Classes | Public Member Functions | Friends | List of all members
ACAPI::ZoneBoundaryQuery Class Reference
Element Manager
This class can be used to query the boundaries of Zones. Before use an Update must be called on it. More...
#include <ZoneBoundaryQuery.hpp>
 Inheritance diagram for ACAPI::ZoneBoundaryQuery:
 Classes
class  | Modifier
Modifier of the ZoneBoundaryQuery. More...
 Public Member Functions
Result< std::vector< ZoneBoundary > >  | GetZoneBoundaries (API_Guid zoneId) const
template<typename ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
ZoneBoundaryQuery  | CreateZoneBoundaryQuery ()
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
This class can be used to query the boundaries of Zones. Before use an Update must be called on it.
Since
Archicad 27
Member Function Documentation
◆ GetZoneBoundaries()
 Result< std::vector< ZoneBoundary > > ACAPI::ZoneBoundaryQuery::GetZoneBoundaries  |  ( |  API_Guid |  zoneId | ) |   const
Parameters
zoneId | The unique identifier of the Zone.
Returns
Returns the boundaries of the given Zone if it exists, otherwise Error.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::ZoneBoundaryQuery::Modify  |  ( |  ModifierFunc && |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
Friends And Related Symbol Documentation
◆ CreateZoneBoundaryQuery
 ZoneBoundaryQuery CreateZoneBoundaryQuery  |  ( |   | )
friend
Since
Archicad 27
Returns
Creates a ZoneBoundaryQuery object.